//@ts-check

var db = ["сумерки", "мглистый", "мгла", "умопомрачительный", "щёголь", "щегольской", "усердие", "экивоки", "юнец", "чопорный", "цветистый", "степенный", "чванливый", "сугубый", "невежество", "перекоряться", "перемолвиться", "пестовать", "удручить", "пакость", "неурядица", "криводушный", "занятный", "угодливый", "кроткий", "лиходей", "лихоимство", "лихой", "невдомёк", "недотёпа", "надобно", "нерадивый", "облыжный", "обуревать", "огорошить", "отвычка", "оторопь", "пагуба", "переимчивый", "перекоры", "покладистый", "подле", "кликушествовать", "злободневный", "чреватый", "обмереть", "обомлеть", "осенить", "голословный", "загодя", "вольнодумство", "брюзга", "бренный", "доколе", "кондовый", "окаянный", "чаяние", "хваткий", "шалый", "спорый", "ретивый", "плюгавый", "оголтелый", "неказистый", "огульный", "претить", "подзуживать", "натореть", "разнузданный", "расхристанный", "сердобольный", "сиречь", "хворый", "тороватый", "скаредный", "чаять", "тщетный", "поборник", "услада", "уповать", "ребячиться", "ребячливый", "потворствовать", "потачка", "норовить", "приноровиться", "наущать", "ратовать", "изрядный", "посему", "благоговение", "дарование", "закавыка", "подоплёка", "брюзжать", "пресловутый", "бессодержательный", "братия", "блюсти", "година"];

getTermsList(function(data){
    db = data;
    localStorage.db = JSON.stringify(db);
    if (localStorage.viewed){
        var tmp = [];
        
        for (var i = 0; i < db.indexOf(localStorage.viewed); i++){
            tmp.push(db[i]);
        }
        db = db.slice(db.indexOf(localStorage.viewed)+1);
        for (var i = 0; i < tmp.length; i++){
            db.push(tmp[i]);
        }
        // console.log(db);
    }
})